In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
data =pd.read_excel('Week_04_HW4_Titanic_Data.xls')

In [5]:
data.head()

,Survived,Passenger Class,Name,Sex,Age,No of Siblings or Spouses on Board,No of Parents or Children on Board,Ticket Number,Passenger Fare,Cabin,Port of Embarkation,Life Boat
0,Yes,First,"Allen, Miss. Elisabeth Walton",Female,29.0000,0,0,24160,211.3375,B5,Southampton,2
1,Yes,First,"Allison, Master. Hudson Trevor",Male,0.9167,1,2,113781,151.5500,C22 C26,Southampton,11
2,No,First,"Allison, Miss. Helen Loraine",Female,2.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN
3,No,First,"Allison, Mr. Hudson Joshua Creighton",Male,30.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN
4,No,First,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",Female,25.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN

In [6]:
data['Survived'].value_counts()

Survived
No     809
Yes    500
Name: count, dtype: int64

In [7]:
df2 = data.copy()

In [8]:
df2.isnull().sum()

Survived                                 0
Passenger Class                          0
Name                                     0
Sex                                      0
Age                                    263
No of Siblings or Spouses on Board       0
No of Parents or Children on Board       0
Ticket Number                            0
Passenger Fare                           1
Cabin                                 1014
Port of Embarkation                      2
Life Boat                              823
dtype: int64

In [9]:
df2.isna().sum().sum()

2103

In [10]:
df2.isnull().sum().sum()

2103

In [11]:
df2["Age"].fillna(df2["Age"].median(),inplace= True)

In [12]:
df2.head()

,Survived,Passenger Class,Name,Sex,Age,No of Siblings or Spouses on Board,No of Parents or Children on Board,Ticket Number,Passenger Fare,Cabin,Port of Embarkation,Life Boat
0,Yes,First,"Allen, Miss. Elisabeth Walton",Female,29.0000,0,0,24160,211.3375,B5,Southampton,2
1,Yes,First,"Allison, Master. Hudson Trevor",Male,0.9167,1,2,113781,151.5500,C22 C26,Southampton,11
2,No,First,"Allison, Miss. Helen Loraine",Female,2.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN
3,No,First,"Allison, Mr. Hudson Joshua Creighton",Male,30.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN
4,No,First,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",Female,25.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN

In [13]:
    data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   Survived                            1309 non-null   object
 1   Passenger Class                     1309 non-null   object
 2   Name                                1309 non-null   object
 3   Sex                                 1309 non-null   object
 4   Age                                 1046 non-null   float64
 5   No of Siblings or Spouses on Board  1309 non-null   int64
 6   No of Parents or Children on Board  1309 non-null   int64
 7   Ticket Number                       1309 non-null   object
 8   Passenger Fare                      1308 non-null   float64
 9   Cabin                               295 non-null    object
 10  Port of Embarkation                 1307 non-null   object
 11  Life Boat                           486 non-null    object
dtypes: float64(2), int64(2), object(8)
memory usage: 122.8+ KB

In [14]:
df2['Port of Embarkation'].fillna(df2['Port of Embarkation'].mode()[0],inplace=True)

In [16]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   Survived                            1309 non-null   object
 1   Passenger Class                     1309 non-null   object
 2   Name                                1309 non-null   object
 3   Sex                                 1309 non-null   object
 4   Age                                 1309 non-null   float64
 5   No of Siblings or Spouses on Board  1309 non-null   int64
 6   No of Parents or Children on Board  1309 non-null   int64
 7   Ticket Number                       1309 non-null   object
 8   Passenger Fare                      1308 non-null   float64
 9   Cabin                               295 non-null    object
 10  Port of Embarkation                 1309 non-null   object
 11  Life Boat                           486 non-null    object
dtypes: float64(2), int64(2), object(8)
memory usage: 122.8+ KB

In [17]:
df2['Life Boat'].fillna("None",inplace=True)

In [18]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   Survived                            1309 non-null   object
 1   Passenger Class                     1309 non-null   object
 2   Name                                1309 non-null   object
 3   Sex                                 1309 non-null   object
 4   Age                                 1309 non-null   float64
 5   No of Siblings or Spouses on Board  1309 non-null   int64
 6   No of Parents or Children on Board  1309 non-null   int64
 7   Ticket Number                       1309 non-null   object
 8   Passenger Fare                      1308 non-null   float64
 9   Cabin                               295 non-null    object
 10  Port of Embarkation                 1309 non-null   object
 11  Life Boat                           1309 non-null   object
dtypes: float64(2), int64(2), object(8)
memory usage: 122.8+ KB